Сравнитель/src/Catalogs/ТаблицыДанных/ТаблицыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТаблицыДанных</name>
  <owners>Catalog.ПравилаСравненияДанных</owners>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриСравненииСтрок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСоединения</name>
    <type>
      <types>EnumRef.СпособыСоединенияТаблицДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Поля</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>DefinedType.ИмяПоляТаблицыДанных</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидПоля</name>
      <type>
        <types>EnumRef.ВидыПолейТаблицДанных</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипИсходногоЗначения</name>
      <type>
        <types>CatalogRef.ОписанияТипов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначенияСравнения</name>
      <type>
        <types>CatalogRef.ОписанияТипов</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательное</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриПолученииЗначенияСравнения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриПолученииПредставления</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриСравненииЗначений</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Сравнитель/src/Enums/БазовыеТипыОписанийТипов/БазовыеТипыОписанийТипов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>БазовыеТипыОписанийТипов</name>
  <enumValues>
    <name>Число</name>
  </enumValues>
  <enumValues>
    <name>Строка</name>
  </enumValues>
  <enumValues>
    <name>Дата</name>
  </enumValues>
  <enumValues>
    <name>Булево</name>
  </enumValues>
  <enumValues>
    <name>ХранилищеЗначения</name>
  </enumValues>
  <enumValues>
    <name>УникальныйИдентификатор</name>
  </enumValues>
</mdclass:Enum>

Сравнитель/src/Catalogs/ТаблицыДанных/Forms/ФормаПоляТаблицы/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.ТекущиеЗначения) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.ТекущиеЗначения, ИменаПередаваемыхРеквизитовТЧ());
	Иначе
		Строка10 = ОписанияТиповКлиентСервер.НовоеОписаниеТипа();
		Строка10.БазовыйТип = Перечисления.БазовыеТипыОписанийТипов.Строка;
		Строка10.ДлинаСтроки = 10;
		
		ТипЗначенияСравнения = ОписанияТипов.Ссылка(Строка10);
		ТипИсходногоЗначения = ОписанияТипов.Ссылка(Строка10);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПередЗакрытиемПослеВопроса", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(ОповещениеОЗакрытии, Отказ, ЗавершениеРаботы
		, ТекстПредупреждения, "ЗакрытьФормуБезПодтверждения");
	//
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипИсходногоЗначенияНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НачатьВыборОписанияТипа("ТипИсходногоЗначения");
КонецПроцедуры

&НаКлиенте
Процедура ТипЗначенияСравненияНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НачатьВыборОписанияТипа("ТипЗначенияСравнения");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	ЗакрытьСРезультатом();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПередЗакрытиемПослеВопроса(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	ЗакрытьСРезультатом();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСРезультатом()
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрЗакрытия = Новый Структура(ИменаПередаваемыхРеквизитовТЧ());
	ЗаполнитьЗначенияСвойств(ПараметрЗакрытия, ЭтотОбъект);
	
	Модифицированность = Ложь;
	Закрыть(ПараметрЗакрытия);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИменаПередаваемыхРеквизитовТЧ()
	Возврат "НомерСтроки, Имя, Синоним, ТипИсходногоЗначения, ТипЗначенияСравнения, ВидПоля
	        |, Обязательное, ПриПолученииЗначенияСравнения, ПриПолученииПредставления, ПриСравненииЗначений";
КонецФункции

&НаКлиенте
Процедура НачатьВыборОписанияТипа(ИмяРеквизита)
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеВыбораОписанияТипа", ЭтотОбъект, ИмяРеквизита);
	ОписанияТиповКлиент.НачатьВыбор(ЭтотОбъект[ИмяРеквизита], ОповещениеОЗавершении);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораОписанияТипа(НоваяСсылка, ИмяРеквизита) Экспорт
	Если НоваяСсылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект[ИмяРеквизита] = НоваяСсылка;
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти
